[
  {
    "company": "Freelance",
    "roles": [
      {
        "title": "Product Design Consultant/Sabbatical",
        "range": "2023–Present",
        "summary": [
          "Took a purposeful sabbatical to recharge, reflect on long-term goals, and provide design mentorship and strategic support to early-stage teams – now focused on rejoining a mission-driven team with fresh clarity and intent."
        ]
      }
    ]
  },
  {
    "company": "Flatiron Health",
    "roles": [
      {
        "title": "Lead Design Systems Manager",
        "range": "2022–2023",
        "summary": [
          "Shaped Flatiron’s design systems strategy by creating, hiring, and leading the dedicated 3-person team supporting 40+ contributors and 20+ products.",
          "Led the shift from a grassroots effort to a funded team supporting internal tools, scaling consistency, efficiency, and design quality across the org.",
          "Collaborated closely with engineering and product stakeholders to define contribution models, governance, and long-term system evolution."
        ]
      },
      {
        "title": "Lead Product Design Manager",
        "range": "2018–2022",
        "summary": [
          "Owned the product design function as an IC across multiple customer-facing teams, supporting products used by 4,200+ clinicians and 5M+ patients.",
          "Drove product direction and improved patient and provider experiences while managing 2–3 designers and mentoring across a 25+ person team.",
          "Shaped team vision, hiring strategy, and collaborative processes as the team scaled from 5 to 25+ designers.",
          "Led early design efforts as <em>Senior Product Designer</em>, driving strategic product improvements across core product areas."
        ]
      }
    ]
  },
  {
    "company": "Fundera",
    "roles": [
      {
        "title": "Principal Product Designer",
        "range": "2017–2018",
        "summary": [
          "Designed and launched Fundera’s first dashboard experience for 20k small business owners, providing a central hub for managing financial tools and data.",
          "Created a scalable framework that enabled ongoing feature development and improved the long-term customer experience."
        ]
      }
    ]
  },
  {
    "company": "Betterment",
    "roles": [
      {
        "title": "Senior Product Designer",
        "range": "2011–2017",
        "summary": [
          "Founding designer at Betterment, growing design from early marketing work to full-stack product leadership across teams and platforms.",
          "Led key product expansions – including the advisor platform and 401k – while building the first design system to support rapid scale.",
          "Contributed to company growth from 12 to 200+ employees and scaled the customer base from ~10K to 250K+.",
          "Supported early-stage product, brand, and frontend growth through roles as <em>Senior Product Designer</em>, <em>Software Engineer</em>, and <em>Graphic Designer</em>."
        ]
      }
    ]
  }
]
